"""
Приложение 'app'

Назначение:
    - Приложение отвечает за взаимодействие между пользователями и задачами - основной логикой приложения

Структура:
    - Модуль admin - регистрация моделей в админке
    - Модуль api - регистрация маршрутов API для взаимодействия пользователей и задач
    - Модуль apps - регистрация приложения
    - Модуль serializers - регистрация сериализаторов для задач и пользователей
    - Модуль tests - тесты для проверки корректности работы приложения
    - Модуль urls - маршруты приложения
"""